import { Student, EducationLevel } from '../types';
import { getAdvisorForGroup } from './allTeachers';

export interface RawStudentRecord {
  id: string;
  fullName: string;
  levelText: string;
  groupCode: string;
}

export const RAW_STUDENTS: RawStudentRecord[] = [
  {
    "id": "6311000041",
    "fullName": "นาย กูอามิง ประกอบการคดี",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6321000039",
    "fullName": "นาย อิมรอน ยะโกะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6321000105",
    "fullName": "นาย ยากี ลาเก๊ะมา",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6421000014",
    "fullName": "นาย รุสลัม สะดีเยาะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6421000126",
    "fullName": "นาย รอมมือลี การะเจ็ง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6521000017",
    "fullName": "นาย ดอเลาะ หะยีบดีงิ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6521000062",
    "fullName": "นาย นาเซ หะสะนิ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6611000059",
    "fullName": "นาย อาสือมัน เจะแว",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6621000010",
    "fullName": "นาย อับดุล ม่วงพัน",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6621000047",
    "fullName": "นางสาว นูรซูไฮดา อารง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6621000065",
    "fullName": "นางสาว ซารีนา มาหะมะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6621000122",
    "fullName": "นางสาว มารียานี แกมะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6711000016",
    "fullName": "นาย มะนาวี มะแซ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6711000025",
    "fullName": "นาย อดิลัน หะสีแม",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6711000128",
    "fullName": "นาย อิบรอเฮง ตาเละ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6711000137",
    "fullName": "นาง ยาวาเฮ เจ๊ะโซะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6711000164",
    "fullName": "นาย อับดุลวอฮะ มะหะดุง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6711000191",
    "fullName": "นางสาว สุไวบ๊ะ อูเซง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6721000013",
    "fullName": "นาย สุวรรณ ละเจ๊ะแล",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6721000022",
    "fullName": "นางสาว ซูไรนี เจ๊ะโซ๊ะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6721000031",
    "fullName": "นางสาว รอฮานี คอเต๊ะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6721000068",
    "fullName": "นาย อาหะมะซัมรี มะเซ็ง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6721000077",
    "fullName": "นาย ฟารุจ นิสากุล",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6721000086",
    "fullName": "นางสาว ซูฟียะ อูเซง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6721000095",
    "fullName": "นาย มุสตากีม สาแม",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6721000107",
    "fullName": "นาย อาลีฟ ดือราแม",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6721000116",
    "fullName": "นาย อัสรี เจ๊ะแม",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6811000028",
    "fullName": "นาย เริงศักดิ์ สาหะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6811000046",
    "fullName": "นาย มูฮำหมัดฮารีฟ ตอกอ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6811000064",
    "fullName": "นาย มูฮัมหมัดอัสรี บินฮะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6811000073",
    "fullName": "นาย มะอัสรี ลีมอปาแล",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6811000091",
    "fullName": "นาย มูฮัมหมัดอัฟฟาน อาแด",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6811000103",
    "fullName": "นาย รีเปง กาเจ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6811000112",
    "fullName": "นาย อิกรอม เวาะหลง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6821000016",
    "fullName": "นาย มะซูบฮี กาซอ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6821000025",
    "fullName": "นาย มูฮัมหมัด เจ๊ะหะมะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6821000034",
    "fullName": "นาย ต่วนอานัส กาเซ็ง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6821000043",
    "fullName": "นาย อนันตชัย ซอเฮาะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6821000052",
    "fullName": "นาย อันวา ยะโกะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6821000061",
    "fullName": "นาย อายูวัน อาบู",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6821000070",
    "fullName": "นาย นิอาบูนียา หะยีนิเลาะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6821000089",
    "fullName": "นาย นัสรันย์ แประสามะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6821000098",
    "fullName": "นาย นัสริน มะมิง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6911000012",
    "fullName": "นาย รอพี แยนา",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000049",
    "fullName": "นาย แดนี่ ปะจู",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000058",
    "fullName": "เด็กชาย มูฮำหมัดแวฟากิม บินยา",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6911000067",
    "fullName": "เด็กหญิง นูรฮาซีกีนี สมาแอ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210008"
  },
  {
    "id": "6911000076",
    "fullName": "นาย ซูเบร รีรา",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6911000085",
    "fullName": "นาย กูอามีน เฮงสาแม",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6911000094",
    "fullName": "นางสาว สตีมารียะ แตเมา๊ะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000106",
    "fullName": "เด็กหญิง อัรฟะฮ์ แก้วมณีชัย",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000115",
    "fullName": "เด็กชาย แวมูฮัมหมัดอัคลี มูซอ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000124",
    "fullName": "นางสาว ฟาตือเมาะ สาและ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210004"
  },
  {
    "id": "6911000133",
    "fullName": "นาย สาเหาะ เปาะกะเด็ง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210037"
  },
  {
    "id": "6911000142",
    "fullName": "นาย เลาะ มะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210037"
  },
  {
    "id": "6911000151",
    "fullName": "นาย มะนาเซ ตีซา",
    "levelText": "ประถมศึกษา",
    "groupCode": "210037"
  },
  {
    "id": "6911000160",
    "fullName": "นาย อุสมาน ฮาแว",
    "levelText": "ประถมศึกษา",
    "groupCode": "210037"
  },
  {
    "id": "6911000179",
    "fullName": "นาย สุไลมาน ยาตามา",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6911000188",
    "fullName": "นาย บิลยามิง มะสะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6911000197",
    "fullName": "นาย อิควัน มะสะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6911000209",
    "fullName": "นาย ไฟซอล มะหะมัด",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000218",
    "fullName": "นาย สมาน วาลี",
    "levelText": "ประถมศึกษา",
    "groupCode": "210002"
  },
  {
    "id": "6911000227",
    "fullName": "นาย อานัส ยูโซะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6911000236",
    "fullName": "นาย อาฟิก มะซง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000245",
    "fullName": "นาย ธนินท์ธร ยะถัง",
    "levelText": "ประถมศึกษา",
    "groupCode": "210039"
  },
  {
    "id": "6911000254",
    "fullName": "นาย อับดุลฟอร์ลัน สาอิ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210038"
  },
  {
    "id": "6911000263",
    "fullName": "นาย ฟิตรี มาแจ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210015"
  },
  {
    "id": "6911000272",
    "fullName": "นางสาว อายเซาะ ตาลีดิงิ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210039"
  },
  {
    "id": "6911000281",
    "fullName": "นางสาว ซารีนา เจ๊ะโซะ",
    "levelText": "ประถมศึกษา",
    "groupCode": "210039"
  },
  {
    "id": "5712000522",
    "fullName": "นาย มุสลิม จาวะมะลา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "5812000329",
    "fullName": "นาย อาหามะซูฮัยมิน บินเซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "5912000247",
    "fullName": "นางสาว รุสนา วาจิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6012000081",
    "fullName": "นางสาว กานารียะฮ์ ตาลาปะอาเลน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6012000223",
    "fullName": "นาย ฮาฟิซ มะลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6012000616",
    "fullName": "นางสาว นูซูลา ยาซิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6012001789",
    "fullName": "นาย ไอดิล ดีรี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6012001873",
    "fullName": "นางสาว มาริสา เลาะยา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6022000444",
    "fullName": "นาย อาติ สามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6022000837",
    "fullName": "นาย อาวี แนฮะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6112000020",
    "fullName": "นาย ฮาซาดิ ลาโละซู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6112000561",
    "fullName": "นาย มะซัยนุน โกะจับ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6112000712",
    "fullName": "นาย รุสลัน ดือรา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6112000730",
    "fullName": "นางสาว กิติมา หะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6112000990",
    "fullName": "นาย ซูสะอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6122000269",
    "fullName": "นาย มูฮำมัดตัรมิซี ติยี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6122000380",
    "fullName": "นางสาว มารียะ บาโอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6122000531",
    "fullName": "นาย อับดุลซาฟารี กลับกลาย",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6122000791",
    "fullName": "นาย อาลีฟ สามะเตะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6122000924",
    "fullName": "นางสาว นุรอดันิน สะสือแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6122001145",
    "fullName": "นางสาว พีตือเราะ ดาแมะยี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6122001202",
    "fullName": "นาย กาแม กาดามุง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6212000715",
    "fullName": "นาย อานัส วาราวอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6212000836",
    "fullName": "นาย อาราวี มะดง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6212000854",
    "fullName": "นาย มูฮัมหมัดคูไซฟี หะยีวาจิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6212001440",
    "fullName": "นาย นาสราน โซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6212001486",
    "fullName": "นาย อาราฟัต ดือเระ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6212001525",
    "fullName": "นางสาว โรกามีซา เต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6222000114",
    "fullName": "นาย กูไอดี โต๊ะนิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6222000404",
    "fullName": "นางสาว รอกียาะ มะลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6222000413",
    "fullName": "นาย อิฟฟัตย์ นาแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6222000477",
    "fullName": "นาย อับดุลสาลาม บินเจ๊ะวานิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6222000507",
    "fullName": "นาย ภานุพันธ์ หลงจิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6222000534",
    "fullName": "นาย มูฮัมหมัดเซาฟีร ปะจู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6222000851",
    "fullName": "นาย พันธ์วงศ์ กลับกลาย",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6312000231",
    "fullName": "นาย อับดุลซาฟิส สตาปอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6312000259",
    "fullName": "นางสาว นูรฮายาตี อาแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6312000277",
    "fullName": "นาย อิบรอเฮม มะรอแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6312000295",
    "fullName": "นาย นูรุดดิน มะแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6312000398",
    "fullName": "นาย อาลีฟ แวฮีเล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6322000014",
    "fullName": "นาย นิไซฟู มามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6322000023",
    "fullName": "นางสาว ซิตีนูรซีซัน ยะโกะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6322000041",
    "fullName": "นาย อัฟฟาน มายิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6322000050",
    "fullName": "นาย นิฟารฮัน นิเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6322000117",
    "fullName": "นาย อับดุลกอฮฮาร์ เจ๊ะอาแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6322000144",
    "fullName": "นางสาว นูรฟูาติริ ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6322000322",
    "fullName": "นาย อัคบาร์ซาวา สะเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6322000434",
    "fullName": "นาย มะนากี วอหะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6322000470",
    "fullName": "นาย อาหามะ วอหะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6322000519",
    "fullName": "นางสาว โซเฟีย พรหมอาไพย",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6322000863",
    "fullName": "นางสาว ไซตน บอเถาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6322001262",
    "fullName": "นาย ซูฟีกา เซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6322001271",
    "fullName": "นาย มูฮัมหมัด ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6322001280",
    "fullName": "นาย มะซูฟี หามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6412000038",
    "fullName": "นางสาว ซีตีฟาตีเมาะ เจ๊ะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6412000056",
    "fullName": "นางสาว ยาวานี สาเมา๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6412000092",
    "fullName": "นาย อริฟาน วาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6412000195",
    "fullName": "นางสาว อาซูรา วาเด็งพงค์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6412000234",
    "fullName": "นาย อันวา อีแต",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6412000270",
    "fullName": "นาย มุรญันต์ ปิยะปิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6412000382",
    "fullName": "นาย อิมรอน มะดาอิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6422000044",
    "fullName": "นาย ซูลฮากีดิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6422000080",
    "fullName": "นางสาว นูรูอกัมา บาหลัง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6422000101",
    "fullName": "นาย กูอัฟนาน ประกอบการคดี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6422000129",
    "fullName": "นางสาว ซูไฮลา ยารี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6422000138",
    "fullName": "นาย อุกาซะ เจ๊ะซามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6422000316",
    "fullName": "นาย ฟิตตรี อาบ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6422000325",
    "fullName": "นางสาว ซูไรคอ ยาอีสะมะแอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6422000334",
    "fullName": "นางสาว นัสริน ดีสะเอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6422000343",
    "fullName": "นาย ลุกมาน ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6512000040",
    "fullName": "นาย ลุกมัง ยูซะลีมาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6512000152",
    "fullName": "นางสาว มีมี พรหมอาไพย",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6512000255",
    "fullName": "นางสาว โซรายา บินยูโซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6512000330",
    "fullName": "นางสาว รอฮีมะ๊ ซามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6512000349",
    "fullName": "นางสาว ซูรา กาเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6512000620",
    "fullName": "นาย ต่วนนาเซ ลอนิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6512000817",
    "fullName": "นาย คุนาวิน อารง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6512000947",
    "fullName": "นาย รุสดี สาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6522000131",
    "fullName": "นาย มูฮำหมัดไฟรุส แซะบดีงิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6522000243",
    "fullName": "นาย สุไลมาน อูมาร์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220041"
  },
  {
    "id": "6522000252",
    "fullName": "นาย ลุกมาน ยาแล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6522000261",
    "fullName": "นางสาว ฟาตีฮะ หะระ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6522000270",
    "fullName": "นาย มูฮัมหมัดโซฟี ซาแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6522000300",
    "fullName": "นางสาว ตัจวญี แช่จ่าว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6522000382",
    "fullName": "นาย มูฮัมหมัดฮัมดัม หะยีสาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6522000403",
    "fullName": "นาย แดเนียล ดือราซอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6612000119",
    "fullName": "นางสาว ฟาตีฮะห์ สือนิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6612000128",
    "fullName": "นาย ลุกมาน ปิดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6612000230",
    "fullName": "นาย มูฮัมหมัดอามัล มือลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6612000333",
    "fullName": "นาย อิมรอน มะแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6612000388",
    "fullName": "นาย ซาฟาวี มะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6612000418",
    "fullName": "นาง อารีฟะ อาแวกะจิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6612000445",
    "fullName": "นางสาว นูรซาเฮรา รอนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6612000463",
    "fullName": "นาย มูซอฟัร วาแต",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220040"
  },
  {
    "id": "6612000481",
    "fullName": "นาย มูหมดัฮูเซง ตาเยะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6622000022",
    "fullName": "นาย มูฮัมมัดไฟซู อูเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6622000068",
    "fullName": "นาย อัสรี เจ๊ะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6622000116",
    "fullName": "นาย ไซมิง เจ๊ะและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6622000170",
    "fullName": "นาย อบัศห์ ม่วงพัน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6622000198",
    "fullName": "นาย อิบรอฮิม มาน๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6622000255",
    "fullName": "นาย อิบรอเฮ็ม ปอรอซู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6622000273",
    "fullName": "นางสาว รูนีย์ เจ๊ะและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6622000291",
    "fullName": "นาย สะแปอิง ดือราแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6622000312",
    "fullName": "นาย มะโซฟี สะมาแอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6622000424",
    "fullName": "นางสาว ลีซาวาตี ตาเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6622000451",
    "fullName": "นาย มูหะมะ มะดีเยาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6622000497",
    "fullName": "นาย ฮากีมัน ยาซิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6622000527",
    "fullName": "นาย ฮาฟีรุส วาโด",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6622000536",
    "fullName": "นาย มะฮาฟีส เลาะแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6622000590",
    "fullName": "นางสาว ซาฮานา ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6622000602",
    "fullName": "นาย ซานูซี ตาเยะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6622000620",
    "fullName": "นาย ซาห์รีฟี บือซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6622000639",
    "fullName": "นางสาว นูรฮีา มะรอแมโน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6622000675",
    "fullName": "นาย มูฮัมหมัดอาลีฟ ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6622000684",
    "fullName": "นาย มูฮำหมัดซาฟีอี อาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6622000705",
    "fullName": "นาย อัสมิง โตะเหะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6622000723",
    "fullName": "นางสาว นูรฮายาตี การะเจ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6712000019",
    "fullName": "นาย อับดุลเราะห์มัน แม็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6712000028",
    "fullName": "นางสาว ไซตง เตะตานิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6712000055",
    "fullName": "นาย วลิดาน หะเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6712000103",
    "fullName": "นาย กันดา สุหลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6712000130",
    "fullName": "นาย ยาหะยา สาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6712000149",
    "fullName": "นาย อับดุลฮากีม อูมา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6712000167",
    "fullName": "นาย อาหามะ ตือเงาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6712000176",
    "fullName": "นาย กูฟารีด กูโอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6712000185",
    "fullName": "นางสาว นูรซีซัน ดารอนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6712000206",
    "fullName": "นาย อับดุลอาเล็ม ดือรามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6712000251",
    "fullName": "นาย กูอับดุลบาริ กุจิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6712000260",
    "fullName": "นาย ซารีฟ บืองาฉา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6712000297",
    "fullName": "นาย รูบีอี จูกูยี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6712000318",
    "fullName": "นาย รอกิ บินมะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6712000327",
    "fullName": "นาย สะการียา ยูโซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6712000336",
    "fullName": "นาย นาโซรี ยะนายาเน็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6712000448",
    "fullName": "นาย อัมดัน สาแลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6712000466",
    "fullName": "นาย ริดวาน สมาแอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6712000475",
    "fullName": "นาย ไฟรุส สาแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6712000514",
    "fullName": "นาย อัฏฮา เจ๊ะเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6712000626",
    "fullName": "นาย อารีฟ มะเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6712000699",
    "fullName": "นางสาว สาฟีรา ตาเย๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6712000729",
    "fullName": "นาย มูฮัมหมัดอะนัส เจ๊ะอูมา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6712000738",
    "fullName": "นาย ธีรวัฒน์ จันทรคง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6712000783",
    "fullName": "นางสาว อัสมีนี ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6712000804",
    "fullName": "นาย ลุกมัน สามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6712000840",
    "fullName": "นาย มูบารอ๊ก ดารายีสาฮอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6712000877",
    "fullName": "นางสาว ซลัมิง จูแฮ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6712000916",
    "fullName": "นางสาว อนีสะ หมัดอะดัม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6712000934",
    "fullName": "นาย อับดุลเราะมัน สามือลา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6712000970",
    "fullName": "นางสาว อัศนี หมัดอาดรัม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6722000016",
    "fullName": "นาย อาสวัน เจะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6722000025",
    "fullName": "นางสาว ลีซาวาตี ฮะยีมะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6722000034",
    "fullName": "นางสาว นิชากร เกื้อทอง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6722000052",
    "fullName": "นางสาว อัสรีนา ฮะยีมะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6722000061",
    "fullName": "นาย อาวาติบ บูแมคาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6722000089",
    "fullName": "นางสาว บีบีซาร่า เจ๊ะปอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6722000098",
    "fullName": "นาย มัสลัน มูหิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6722000100",
    "fullName": "เด็กชาย ราฟี่ ปะจูศาลา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6722000119",
    "fullName": "นาย มะการี ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6722000128",
    "fullName": "นาย อานูวา เจ๊ะดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6722000137",
    "fullName": "นาย มูฮัมหมัดนัฟซิห์ สายากู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6722000146",
    "fullName": "นาย มูฮัมหมัดฟาอีซ ยูโซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6722000155",
    "fullName": "นางสาว นูรฮีนัน วาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6722000164",
    "fullName": "นาย มุสลีมีน มะดาอิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6722000173",
    "fullName": "นาย อับดุลฮากีม ลาโบ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6722000182",
    "fullName": "นาย นิดูอาร์ นินา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6722000191",
    "fullName": "นาย ตอลฮะห์ วาเฮง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6722000203",
    "fullName": "นาย รอมฎอน อามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6722000212",
    "fullName": "นาย มูฮัมหมัด ดิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6722000221",
    "fullName": "นาย อับดุลมูฮัยมิน มาซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6722000230",
    "fullName": "นาย มูฮำหมัดไซฟู ฮะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220041"
  },
  {
    "id": "6722000249",
    "fullName": "นาย มูฮัมหมัดไซฟู ยะซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220041"
  },
  {
    "id": "6722000258",
    "fullName": "นาย ซาฟาฮีน ดาหะแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6722000267",
    "fullName": "นาย บาดือรู บินดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6722000276",
    "fullName": "นาย อาฟิก บือราเฮง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6722000285",
    "fullName": "นาย อิสมัต ยีรอหา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6722000294",
    "fullName": "นางสาว นูรอยัมาน วาพา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6722000306",
    "fullName": "นาย มูฮำหมัดซูกีนี บากา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6722000315",
    "fullName": "นาย มูฮำหมัด ตาตอเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6722000324",
    "fullName": "นาย รอมือลี สาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6722000333",
    "fullName": "นาย อัมรี ปานาเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6722000342",
    "fullName": "นาย มูฮัมหมัดซาฟีอี ตาตอเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6722000351",
    "fullName": "นาย มะฟันดี ดามูน๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6722000379",
    "fullName": "นาย มุคลีซัน เจ๊ะแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6722000388",
    "fullName": "นาย ซูเปียน เจ๊ะอูมา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6722000397",
    "fullName": "นางสาว ฝาติน มาลอตาฮู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6722000409",
    "fullName": "นาย มูฮัมหมัดอูบัย วาแต",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6722000418",
    "fullName": "นาย ฮัมกัล รอมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6722000427",
    "fullName": "นาย อิมรอน สาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6722000472",
    "fullName": "นางสาว ซารีฮะ๊ มูซอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6722000490",
    "fullName": "นาย อริฟาน มูซอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6722000502",
    "fullName": "นาย ซูดี มะราเซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6722000511",
    "fullName": "นาย เฟาซัน ฮามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6722000520",
    "fullName": "นางสาว ฟิรดาวส์ ซารีมะแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6722000539",
    "fullName": "นาย อาฮามะ วานิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6722000548",
    "fullName": "นาย มูฮัมหมัดซาไฮรา บูละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6722000557",
    "fullName": "นางสาว นิฮัสวานี นิกานิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6722000566",
    "fullName": "นาย ฮัมเซาะห์ เจ๊ะดือเระ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6722000575",
    "fullName": "นาย นิมูฮำหมัดฆอยรณ สาเหะเยะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6722000584",
    "fullName": "นาย นิฮาเรฟ บินสาเมา๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6722000593",
    "fullName": "นาย อาฟันดี อาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6722000605",
    "fullName": "นาย อัฏฮา สะอิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6722000614",
    "fullName": "นาย สาเหะบากอรี สาเหะเยะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6722000623",
    "fullName": "นาย มูฮัมมัดลิสฟูร์ ยดีงิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6722000632",
    "fullName": "นาย มูฮัมหมัดรอมฎอน อาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6722000641",
    "fullName": "นาย อัซฟันดี อยีา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6722000650",
    "fullName": "นาย ฟิตรี ดวงตา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6722000678",
    "fullName": "นาย ฟารมี สะอิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6722000687",
    "fullName": "นาย มะโซกี อูมา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6722000696",
    "fullName": "นาย ไซมิง ตาเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6722000708",
    "fullName": "นางสาว สอรยีะ๊ ตอกอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6722000717",
    "fullName": "นาย วาอิล ดาโอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6812000012",
    "fullName": "นาย อลิฟาน มะดีซู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6812000021",
    "fullName": "นางสาว ซาวานาบีลา วาเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6812000030",
    "fullName": "นาย ฟัยซู บาสอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6812000049",
    "fullName": "นางสาว นูร์นาซีฟา บาราเห็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6812000058",
    "fullName": "นาย อานัส มะดาบู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6812000067",
    "fullName": "นาย มูฮำหมัดไอมานราฟี หะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6812000076",
    "fullName": "นาย ซุลกิพลี ลาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6812000085",
    "fullName": "นางสาว ซอลฮีา กูนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6812000094",
    "fullName": "นาย ฮากีมี สุดาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6812000106",
    "fullName": "นาย สุกรี สาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6812000115",
    "fullName": "นาย อิลฮัม มาหะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6812000124",
    "fullName": "นาย ริฏวาลย์ บือซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6812000133",
    "fullName": "นาย มูหามะฮาครมิ อาแด",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6812000142",
    "fullName": "นาย มูฮำหมัดไฟซอล เด็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6812000151",
    "fullName": "นาย สมชาย สะอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000160",
    "fullName": "นาย อามีน สาแมแมง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000179",
    "fullName": "นาย ต่วนอัฟฎอล ประกอบการคดี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000188",
    "fullName": "นาย ฮิลมีย์ เจ๊ะโดแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000197",
    "fullName": "นาย อภิชาต สะอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000218",
    "fullName": "นาย มูฮำหมัดซอบรี บินดือรามัน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000227",
    "fullName": "นางสาว ฟาดิลา ปูเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000236",
    "fullName": "นางสาว ฮุสนี รอนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000245",
    "fullName": "นางสาว ฮุสนา รอนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000254",
    "fullName": "นางสาว วีดาสูด็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000263",
    "fullName": "นางสาว อามาลีนา บินอาสัน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000272",
    "fullName": "นาย อานัส เบ็ญอิบราเฮง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000290",
    "fullName": "นาย ฟุรกอน มะอูเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6812000302",
    "fullName": "นาย ฟาเดล ดือมาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6812000311",
    "fullName": "นาย มูฮำหมัดฟารุก สะแปอิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6812000320",
    "fullName": "นาย อับดุลกอฟูร มะแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6812000339",
    "fullName": "นาย มูฮำหมัดตามีซี สาแล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6812000348",
    "fullName": "นาย อัสมาน อิสลามกุล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6812000357",
    "fullName": "นาย ริฏวาน อาแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6812000366",
    "fullName": "นาย มูฮัมหมัดอาริฟ ดรึาแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6812000375",
    "fullName": "นาย อามิน บัวทอง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6812000384",
    "fullName": "นาย มะตอเฮ เจ๊ะแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6812000393",
    "fullName": "นาย ธันวา เหม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6812000405",
    "fullName": "นาย มูฮำหมัดอาวาติฟ วาเด็งพงศ์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000414",
    "fullName": "นางสาว กูวาตี นิตอกอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000423",
    "fullName": "นาย มูหมดั บินยาซิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000432",
    "fullName": "นางสาว รอฮานา สะมะแอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000441",
    "fullName": "นาย อับดุลการิม กือโด",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6812000450",
    "fullName": "นางสาว ซิตีมารียะ เราะสู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6812000469",
    "fullName": "นาย อาลีฟ ยะนาบาเน็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6812000478",
    "fullName": "นาย ซอลฮีนี วาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220040"
  },
  {
    "id": "6812000496",
    "fullName": "นาย สุไฮมิง ดอฆอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6812000508",
    "fullName": "นาย สุไลมาน เจะเลาะมะสาเอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000517",
    "fullName": "นาย อุสมาน ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6812000526",
    "fullName": "นางสาว พาดิละห์ มะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6812000535",
    "fullName": "นางสาว รอกีย๊ะ หมัดอะดรัม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6812000544",
    "fullName": "นาย ฮัมดา กาปายะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000553",
    "fullName": "นาย นิอัฏฮา หะยีนิอาอิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6812000562",
    "fullName": "นาย แวซารีฟุดดีน แวสาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000571",
    "fullName": "นางสาว นุสรา ท่อทิพย์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6812000580",
    "fullName": "นางสาว ซารีฟะ ปานาเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6812000599",
    "fullName": "นาย อาลีฟ สาแมง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6812000601",
    "fullName": "นาย อัซรอฟ แซมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6812000610",
    "fullName": "นางสาว นุรฮิลมี บาฮา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6812000629",
    "fullName": "นาย ยิฟรีย์ เยะมูเร็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6812000638",
    "fullName": "นาย มะยาฮารี ขาเดร์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6812000647",
    "fullName": "นาย อาริฟท์ แซมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6812000665",
    "fullName": "นาย นูรูลอิกหม่าน ยาลา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6812000674",
    "fullName": "นางสาว นูตีปะ มานง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000683",
    "fullName": "นางสาว ใจฟ้า สะมะแอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6812000692",
    "fullName": "นาย มูฮัมหมัดบะฮ์รี หะยีเจ๊ะหลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6812000704",
    "fullName": "นาย บัดรู หะยีมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6812000713",
    "fullName": "นาย ฮาฟีซีน ซาลีซิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6812000722",
    "fullName": "นาย อับดุลฟาตะห์ สิน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6812000731",
    "fullName": "นางสาว มารียะ ปะอิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6812000740",
    "fullName": "นาย ซูเฟียน แมและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6822000037",
    "fullName": "นางสาว นาซีมี สะนิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6822000046",
    "fullName": "นาย นัสรูดีน เจ๊ะแน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6822000064",
    "fullName": "นาย อับดุลกุดดูซ วานิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6822000073",
    "fullName": "นาย อัลฮากีมร์ สูลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6822000091",
    "fullName": "นางสาว นาเดียร์ ยะโก๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6822000103",
    "fullName": "นาย บุชรันตร์ บินแมง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6822000112",
    "fullName": "นาย อาฟันดี เจ๊ะคอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6822000121",
    "fullName": "นางสาว นูรซีา นิมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6822000130",
    "fullName": "นาย มะซูไฮมิง เซียะนะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6822000149",
    "fullName": "นาย มูฮัมหมัดไฟซอล ซอและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6822000158",
    "fullName": "นาย รุสลัน มามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6822000167",
    "fullName": "นาย มะนาเซ เจ๊ะแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6822000185",
    "fullName": "นาย อัรฟาน เจะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220040"
  },
  {
    "id": "6822000194",
    "fullName": "นาย มูฮำหมัดซอฟี เปาะสู",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6822000206",
    "fullName": "นาย พาอิล มามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6822000215",
    "fullName": "นาย มูฮำหมัดฟาเดล วี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6822000224",
    "fullName": "นาย มูฮัมหมัดอัลอามีน เจ๊ะอาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6822000233",
    "fullName": "นาย อับดุลลอฮ สนัหมาน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6822000242",
    "fullName": "นางสาว นุรบัลกิส แลนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6822000251",
    "fullName": "นาย วันมูฮำหมัด ตุลยาพงศ์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6822000260",
    "fullName": "นางสาว โซเฟียนี มะดีแม็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6822000279",
    "fullName": "นาย รีดวูน ปานาปาแน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6822000288",
    "fullName": "นาย ลุตฟี มะแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6822000297",
    "fullName": "นางสาว นูรฮายาตี ซูมา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6822000309",
    "fullName": "นาย ฟิรฮาน มะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6822000327",
    "fullName": "นาย อาลีฟ ยามา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6822000336",
    "fullName": "นาย รุสซูวาน มะดีเยาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6822000345",
    "fullName": "นาย เกาซัร ติยี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6822000354",
    "fullName": "นาย มูฮำหมัดฟารุก บินหะยีดีงิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6822000363",
    "fullName": "นาย ซิกริละห์ มะเก",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6822000372",
    "fullName": "นาย อริฟาน ยะโกะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6822000381",
    "fullName": "นาย รีดวาน สามอเฮ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6822000390",
    "fullName": "นาย ไพสิฐ ภูประเสริฐ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6822000402",
    "fullName": "นาย มูฮัมหมัดบักริส ตาเย๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6822000411",
    "fullName": "นาย มูฮำหมัดอัศราฟ มะดีเยาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220015"
  },
  {
    "id": "6822000420",
    "fullName": "นางสาว พาบีละ๊ ประอุ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6822000439",
    "fullName": "นาย ดุลเลาะ สะแลแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6822000448",
    "fullName": "นาย อัมรี ยะโกะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000457",
    "fullName": "นาย หนึ่ง มะดาแฮ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000466",
    "fullName": "นาย อิลฮาม ยูโซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000475",
    "fullName": "นาย นัฟกาฬ แประสามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000484",
    "fullName": "นางสาว นูร์ฮีดายะห์ บินมานะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000493",
    "fullName": "นาย มูฮัยมี ยูโซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000505",
    "fullName": "นาย รุสกีย์ นิมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000514",
    "fullName": "นาย ลุกมัน สามะดาหะแมง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000523",
    "fullName": "นาย อิบฟาน มูนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000532",
    "fullName": "นาย อายูบ เกาะแมง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000541",
    "fullName": "นางสาว ซารีมะ กาซอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000550",
    "fullName": "นาย มูฮัมหมัดซัยฟู ดือราแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000569",
    "fullName": "นางสาว บุศรอ สามะเระ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000578",
    "fullName": "นาย อัฏวาน ราแดง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000587",
    "fullName": "นาย ตอฮา มะหะดุง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000596",
    "fullName": "นาย อิสเฮาะ จูแร",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6822000608",
    "fullName": "นาย อัฏฮา ตูแวอูมา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6822000617",
    "fullName": "นางสาว รุสนานี สือนิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6822000626",
    "fullName": "นางสาว ซาปียะห์ สือรี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6822000635",
    "fullName": "นางสาว ฮานี มะมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6822000644",
    "fullName": "นาย ฮาซือมัน เวา๊ะบ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6822000653",
    "fullName": "นางสาว ไอนี สะบูดิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6822000662",
    "fullName": "นาย อารอฟาต แตนิมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6822000671",
    "fullName": "นางสาว เจ๊ะซูฮัยรา แมแย",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000680",
    "fullName": "นาย ยัสยูดาห์ สาและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000699",
    "fullName": "นาย ไพศาล เจ๊ะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000701",
    "fullName": "นางสาว นูรนาอนี รอแมดี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000710",
    "fullName": "นาย มาหะมะคอเบร์ รอแมดี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000729",
    "fullName": "นาย ฮาเซ็ง รอแมดี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000738",
    "fullName": "เด็กหญิง ฟิรดาวซ์ ฮีแต",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000747",
    "fullName": "นาย มูชามิร์ หะยีมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6822000756",
    "fullName": "นางสาว ซารีพะ๊ รอซิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000765",
    "fullName": "นางสาว อาสือหม๊ะ แป",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6822000783",
    "fullName": "นางสาว นูร์อยั ซามะเปาะกา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6822000792",
    "fullName": "นาย รอซาลี ฮาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000015",
    "fullName": "นางสาว นัจญวา อาแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000024",
    "fullName": "นางสาว อัสมา อีแต",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6912000033",
    "fullName": "นาย มูฮำหมัดอัมรัน เจ๊ะดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6912000042",
    "fullName": "นาย มูฮัมหมัดฟาอิซ มะรือซะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6912000051",
    "fullName": "นาย ซัยดีย์ สะนิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220001"
  },
  {
    "id": "6912000060",
    "fullName": "นาย บีลา นาสา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6912000079",
    "fullName": "นาย การีมี ลืออาแด",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000088",
    "fullName": "นาย มูฮัมหมัดอารอฟะห์ มามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000097",
    "fullName": "นางสาว วาฮีดา ยอแม็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000109",
    "fullName": "เด็กชาย ฟีดาอีย์ ยีหวังกอง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6912000118",
    "fullName": "นางสาว ฟารอฮะห์ ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000127",
    "fullName": "นาย ฟารุ สามะแอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000136",
    "fullName": "นางสาว อับดุลเลาะ มะลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000145",
    "fullName": "นาย ซุบฮี เลาะยา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000154",
    "fullName": "นางสาว นูรฟาเดียร์ อิซอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000163",
    "fullName": "นาย มูฮัมหมัดฟาอิส บือราเฮง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000172",
    "fullName": "นาย อับดุลเราะห์มาน บินเปาะเอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000181",
    "fullName": "นาย มูฮัมหมัดสุไลมาน ยะโกะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000190",
    "fullName": "นาย แวอาซิ บินแวสุหลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000202",
    "fullName": "นางสาว ซารีนี มาหะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000211",
    "fullName": "นาย อาซอฟา เจ๊ะมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000220",
    "fullName": "นาย ซุบฮี บินดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000239",
    "fullName": "นาย อับดุลกอยยูม ซอมูดอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000248",
    "fullName": "นาย ฮาดี วาโด",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000257",
    "fullName": "นางสาว ฮาซาน๊ะ อะสัน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000266",
    "fullName": "นาย อริฟาน บินดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000275",
    "fullName": "นาย ซุกรี แตนิมะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000284",
    "fullName": "นาย มูฮัมมัดนาวาวี ตีซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000293",
    "fullName": "นาย อับดุลเราะห์มาน ตีซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000305",
    "fullName": "นางสาว วาลอาฟียะห์ ตาลาปะอาเลน",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000314",
    "fullName": "นางสาว ฮาบีบะห์ ตีซา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000323",
    "fullName": "นาย อิลฮัม อาแว",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000332",
    "fullName": "นาย ฮูซัยฟัต ขอเดร์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6912000341",
    "fullName": "นาย อิมรอน สะบูดิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220041"
  },
  {
    "id": "6912000350",
    "fullName": "นาย รุสลัน ตอเละ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6912000369",
    "fullName": "นาย อับดุลสลาม อาบ๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6912000378",
    "fullName": "นางสาว ซูไฮลา มะแซ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6912000387",
    "fullName": "นาย อาลี มะอูเซ็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220040"
  },
  {
    "id": "6912000396",
    "fullName": "นางสาว ยานี แลแงแนะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6912000408",
    "fullName": "นางสาว สิตีนุรอาลียาณา สาแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6912000417",
    "fullName": "นางสาว อารีนา ตูแป",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000426",
    "fullName": "นาย อาหมัดฮัมดี สุดสุข",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000435",
    "fullName": "นางสาว นูรฟาซีลา ยามาแล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6912000444",
    "fullName": "นางสาว ฟาตีฮา สะมะนอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6912000453",
    "fullName": "นาย มูฮัมหมัดวอีาน ยามาแล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6912000462",
    "fullName": "นาย มูฮัมหมัดลุตฟี ดือราซอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6912000471",
    "fullName": "นาย สรรชัย ชะโนวรรณะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6912000480",
    "fullName": "นาย ซูเบร์ วาหลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000499",
    "fullName": "นาย มูฮัมหมดั อีซวูนั วานิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220009"
  },
  {
    "id": "6912000501",
    "fullName": "นางสาว วีณา หลงจิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000510",
    "fullName": "นาย อายูบ สะเลหมาดดม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000529",
    "fullName": "นาย รุซลัน ดามิเด็ง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6912000538",
    "fullName": "นาย มาสลี บือราเฮง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220004"
  },
  {
    "id": "6912000547",
    "fullName": "นาย นิฟัฏลี แม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220031"
  },
  {
    "id": "6912000556",
    "fullName": "นาย มูฮัมหมัดอัฏฮา มามะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000565",
    "fullName": "นาย ฮัซมาน อาลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000574",
    "fullName": "นาย สาปูวัน ดือรอแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000583",
    "fullName": "นางสาว สตีพี าตีเมาะ วานิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220007"
  },
  {
    "id": "6912000592",
    "fullName": "นาย ธวัฒชัย นิลมาลย์",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000604",
    "fullName": "นาย เกรฎิพล หะยีวาเงาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000613",
    "fullName": "นาย นัสรี กาดามุง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6912000622",
    "fullName": "นางสาว นุรอยันี่ แมเราะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000631",
    "fullName": "นาย ฟัจรีย์ สาอิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000640",
    "fullName": "นาย อารีฟาน เจ๊ะแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6912000659",
    "fullName": "นาย มูฮำหมัดราฟี เจ๊ะหนิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000668",
    "fullName": "นาย ซูไฮมี มิ่งประเสริฐกุล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220010"
  },
  {
    "id": "6912000677",
    "fullName": "นางสาว อาซีย๊ะ ดามะเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000686",
    "fullName": "นาย ฮัมดีย์ เจ๊ะเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000695",
    "fullName": "นาย อัฟด๊อลร์ แซมิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000707",
    "fullName": "นาย อับดุลบาซิต ยดีงิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000716",
    "fullName": "นาย อับดุลรอมัน ดือราแม",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000725",
    "fullName": "นาย อัซลัน โวะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000734",
    "fullName": "นาย อิมรันทร จินตรา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6912000743",
    "fullName": "นาย เจ๊ะมูฮัมมัดอารีฟ รีรา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000752",
    "fullName": "นางสาว ฮาลีเมาะ ติยี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220012"
  },
  {
    "id": "6912000761",
    "fullName": "นาย ต่วนฟาริส ต่วนและ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220039"
  },
  {
    "id": "6912000770",
    "fullName": "นาย มูฮัมหมัดฟิตรี อามัด",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000789",
    "fullName": "นางสาว นูรซูไฮณี อารง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000798",
    "fullName": "นาย มูฮัมมัดตอฟิร อารง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220008"
  },
  {
    "id": "6912000800",
    "fullName": "นางสาว นูรมี ปูเตะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000819",
    "fullName": "นาย ซาฟูวัน สมอดียอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000828",
    "fullName": "นาย นูรุดดีน ตาเละ๊",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000837",
    "fullName": "นาย อับดุลฟารี สาอิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000846",
    "fullName": "นาย ซอฟวัน ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220014"
  },
  {
    "id": "6912000855",
    "fullName": "นาย อับดุลเราะมัน ลีมอปาแล",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000864",
    "fullName": "นาย อาหมัด แดเมาะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000873",
    "fullName": "นาย ซูเพียน อาหลี",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220016"
  },
  {
    "id": "6912000882",
    "fullName": "นาย อัชร๊าฟ บือราเอง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220002"
  },
  {
    "id": "6912000891",
    "fullName": "นาย อับดุลฮากีม ลอดิง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220003"
  },
  {
    "id": "6912000903",
    "fullName": "นาย อริฟาน สะอะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220023"
  },
  {
    "id": "6912000912",
    "fullName": "นางสาว นูราซาฟีนี บือราเฮง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220038"
  },
  {
    "id": "6912000921",
    "fullName": "นางสาว ฮาลีมาะ ลาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220042"
  },
  {
    "id": "6912000930",
    "fullName": "นาย ซัยฟุดดีน เจ๊ะลอ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220042"
  },
  {
    "id": "6912000949",
    "fullName": "นาย ฟัฆรูลอารีฟีน มาหะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6912000958",
    "fullName": "นาย อาเด๊ะปา ปานาหม๊ะ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220040"
  },
  {
    "id": "6912000967",
    "fullName": "นางสาว นัสเราะห์ วาหลง",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6912000976",
    "fullName": "นางสาว ไอนิง ยากรา",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220022"
  },
  {
    "id": "6912000985",
    "fullName": "นาย มุสตากี สะอิ",
    "levelText": "มัธยมศึกษาตอนต้น",
    "groupCode": "220005"
  },
  {
    "id": "6013000039",
    "fullName": "นางสาว นูรฮีดายะห์ เจ๊ะแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6013000468",
    "fullName": "นาย มูฮัมหมัดไฟซู สะมาแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6013000936",
    "fullName": "นางสาว ไซนะ มะเย็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6013001054",
    "fullName": "นาย อาบีดีน หะเดวา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6013001296",
    "fullName": "นาย ฮารีส หะยีเจ๊ะแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6023000111",
    "fullName": "นางสาว นูรไอนา ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6023000232",
    "fullName": "นางสาว นูรอาซีกี ดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6023000278",
    "fullName": "นาย คมกฤช มะมิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6023001145",
    "fullName": "นาย เจ๊ะสะมะแอ จิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6113000153",
    "fullName": "นาย อาพันดี ลาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6113000470",
    "fullName": "นาย ฟุรกอน ลีมอปาแล",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6113000779",
    "fullName": "นาย อิมรอน อาแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6113000984",
    "fullName": "นาย อยือริง ยะนาบาเน็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6113001338",
    "fullName": "นางสาว นาเดียร์ ซูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6113001347",
    "fullName": "นาย มูฮัมหมัดซอฟี รีขะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6123000235",
    "fullName": "นาย มาหะมะสับรี หะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6123000767",
    "fullName": "นางสาว นูรีซา เจ๊ะมิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6123000776",
    "fullName": "นางสาว กามีละห์ สะบูดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6123000785",
    "fullName": "นาย อับดุลซาลัม เจ๊ะมู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6123000794",
    "fullName": "นางสาว นูรีมัน เปาะซา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6123000824",
    "fullName": "นาย บูซลัน ยะโกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6123000833",
    "fullName": "นาย ลุกมัน มะดีเยาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6123000963",
    "fullName": "นาย อิบรอเฮม จีจา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6123001278",
    "fullName": "นางสาว ซารีนา ดอแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000165",
    "fullName": "นาย อาลีซัน และ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000183",
    "fullName": "นางสาว นาเดีย สามะเร๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000213",
    "fullName": "นาย บาสลาน ยะสูงอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000231",
    "fullName": "นางสาว อาซียะ บือราเฮง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000268",
    "fullName": "นางสาว แวนีสะ แวนากอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6213000389",
    "fullName": "นางสาว ซีฮาม ตูแกบือซี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6213000400",
    "fullName": "นางสาว นูรีซัน แมเถาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6213000419",
    "fullName": "นาย อับดุลรอฮีม ซอมูดอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6213000521",
    "fullName": "นาย แวอาลียะห์ แวดาโอะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000530",
    "fullName": "นางสาว ยัสมี ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6213000688",
    "fullName": "นางสาว กูไอนิง สาเม๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6213000697",
    "fullName": "นางสาว ยัสมี มุมู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6213001201",
    "fullName": "นาย ฟากีมัน ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6223000069",
    "fullName": "นาย อัมรัน ซูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6223000247",
    "fullName": "นาย อับดุลฮาฟีส สะรอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6223000304",
    "fullName": "นาย มะสาและ มะนุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6223000386",
    "fullName": "นาย ไอมาน โซ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6223000425",
    "fullName": "นาย อรรคเดช โคตรสมบัติ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6223000434",
    "fullName": "นาย มูฮัมมัดดาริส มุกดาสวัสดิ์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6223000461",
    "fullName": "นาย มะอูเซ็ง เตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6223000500",
    "fullName": "นาย อับดุลราฮิม มะสาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6223000519",
    "fullName": "นาย นิอิลมาม นิยอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6223000528",
    "fullName": "นาย นิอาริส นิยอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6223000564",
    "fullName": "นางสาว นูรฟิตตรี ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6223000573",
    "fullName": "นางสาว ณูรเดียนา เจ๊ะอาแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6223000612",
    "fullName": "นางสาว ซูรีดา บินเง๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6313000177",
    "fullName": "นางสาว รอฮานา มะดีเย๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6313000391",
    "fullName": "นาย ซายูนันต์ เยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6313000403",
    "fullName": "นางสาว นุรอาซีกีน ซาแมง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6313000467",
    "fullName": "นาย มูฮัมมัดฟิรดาว มะดาโอะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6313000494",
    "fullName": "นางสาว นูรฮัน ดีเย๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6313000560",
    "fullName": "นางสาว มารียะห์ ฮามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6313000627",
    "fullName": "นางสาว บีบีฮาวา เจะโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6313000636",
    "fullName": "นาย แวอาสรี เงาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6313000645",
    "fullName": "นางสาว ฮาริณี อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6313000784",
    "fullName": "นางสาว ยาวานี มะลาเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6323000053",
    "fullName": "นาย อารีฟิน ดามุง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6323000101",
    "fullName": "นาย ลุกมาน อาลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6323000192",
    "fullName": "นางสาว นาริ ลิติยี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6323000277",
    "fullName": "นาย อิสรัณต์ บะอู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6323000286",
    "fullName": "นางสาว ฮาซียะห์ เจ๊ะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6323000446",
    "fullName": "นาย นพกานต์ สะแลแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6323000473",
    "fullName": "นาย มูฮัมหมัดฮาฟีซี วามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6323000491",
    "fullName": "นาย อิรฟาร เงาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6323000558",
    "fullName": "นาย อาซูวัน ลาสารี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6323000567",
    "fullName": "นาง ยาวาแฮ จอแมมูนะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6323000679",
    "fullName": "นาย สนทยา มิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6323000688",
    "fullName": "นางสาว รอฮีบ๊ะ หะยีกาเดร์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6323000718",
    "fullName": "นาย นิยีมิน มะแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6323000727",
    "fullName": "นาย นิฮากี ปานาหม๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6323000811",
    "fullName": "นาย อาหะมะ ฆาริง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6323000950",
    "fullName": "นาย อามาน วาเด็งพงษ์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6413000086",
    "fullName": "นางสาว นาเดีย สะมะยีตา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6413000095",
    "fullName": "นาย การีมี โตะนา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6413000116",
    "fullName": "นางสาว ซูรียานี ตาเยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6413000237",
    "fullName": "นาย อิลฮัมร์ ละหะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6413000406",
    "fullName": "นาย นิอุสมาน สาอุวา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6413000639",
    "fullName": "นาย อับดุลหะกิม มะโรหบุตร",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6413000723",
    "fullName": "นาย อาหมัด สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000056",
    "fullName": "นาย ซุบฮี เปาะสู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000074",
    "fullName": "นาย ซูฟรัน เปาะสู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000083",
    "fullName": "นาย แวรุสลี มะเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6423000186",
    "fullName": "นาย อิซซุดดีน บาเฮาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000207",
    "fullName": "นาย อิรฟาน เวาะเจ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000252",
    "fullName": "นาย กูเอรี่ ซากาปลายะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000261",
    "fullName": "นาย อัซมิน บือราเฮง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000298",
    "fullName": "นาย ซาฮาราน หะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6423000485",
    "fullName": "นาย อัมมาร หะแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6423000588",
    "fullName": "นาย ฮานีฟ ดือรามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6513000025",
    "fullName": "นางสาว อาตีกะห์ ดอเล๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6513000043",
    "fullName": "นาย อาเรฟ สุหลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6513000052",
    "fullName": "นาย ฮาริฟ สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6513000098",
    "fullName": "นางสาว มาซีเตาะ มะสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6513000100",
    "fullName": "นาย ไซฟูดีน เปาะเตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6513000146",
    "fullName": "นาย อิจลาล สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6513000164",
    "fullName": "นางสาว นูรไอนี อาลีมาอะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6513000182",
    "fullName": "นาย มูฮามะฟันดี สามะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6513000212",
    "fullName": "นางสาว ฮาบีบะห์ เจะแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6513000230",
    "fullName": "นางสาว นูรีตา บาซอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6513000249",
    "fullName": "นาย อับดุลมุมิน ดือราขาเด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6513000258",
    "fullName": "นาย บัดรอซาม มะดีเย๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6513000342",
    "fullName": "นางสาว รอฮานี ซะตา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6513000351",
    "fullName": "นางสาว นูรฟารีซัน เจะโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6513000502",
    "fullName": "นาย อาบิด สูเตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6513000593",
    "fullName": "นางสาว ซูไฮลา มธุระสุวรรณ์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6513000735",
    "fullName": "นาย อาหะมะ มูซอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6513000753",
    "fullName": "นางสาว ฮาฟีเส๊าะห์ อับดุลสมัด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6513000810",
    "fullName": "นางสาว ซีตีอัยดะหฺ สะบูดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6513000847",
    "fullName": "นางสาว ฟิตดาว กาเทพ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6513000904",
    "fullName": "นาย เจ๊ะอามิง ปูเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6513000940",
    "fullName": "นางสาว นายีฮา ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6523000031",
    "fullName": "นาย อิลฮัม สาเล็ม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6523000077",
    "fullName": "นาย สุไบดีห์ มะเด็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6523000134",
    "fullName": "นาย มือดอเลาะ วี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6523000152",
    "fullName": "นางสาว ยีวาตี เจะมิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6523000170",
    "fullName": "นางสาว กามีลา หะดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6523000189",
    "fullName": "นาย ปูคอรี สตาปอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6523000264",
    "fullName": "นาย อิดริส ติยา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6523000358",
    "fullName": "นาย บาซีรัน ซะยาสา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6523000451",
    "fullName": "นางสาว ฮามีมี บินเจ๊ะอูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6523000460",
    "fullName": "นาง เจ๊ะซูรายา ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6523000536",
    "fullName": "นาย อับดุลอาซิ หลีเจริญ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6523000554",
    "fullName": "นาย อิรฟาน แมเราะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6613000064",
    "fullName": "นาย ฟารุต ลาเตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6613000327",
    "fullName": "นางสาว ฮาซานะ เปาะเฮง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6613000336",
    "fullName": "นาย มูฮัมหมัดฟัครูดีน อูมาร์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6613000354",
    "fullName": "นาย อัซรอน ดือเระ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6613000457",
    "fullName": "นางสาว นันท์นภัส ตางจงราช",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6613000475",
    "fullName": "นาย มะรอฟี เจ๊ะหะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6613000505",
    "fullName": "นาย อาริฟ ยะปา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6613000541",
    "fullName": "นาย นิคอยด์โรล หะยีนิเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6623000016",
    "fullName": "นางสาว ซูฟียะห์ วาโด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6623000034",
    "fullName": "นางสาว นัจลาฮ์ ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6623000043",
    "fullName": "นาย บุนยะมิน ดามิเด็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6623000061",
    "fullName": "นาย อิสมาแอ ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6623000137",
    "fullName": "นางสาว นูรุลฮุษณา ฮามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6623000146",
    "fullName": "นางสาว ไซนับ ตาเยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6623000182",
    "fullName": "นางสาว นูรอัลฟาร์ มะมิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6623000230",
    "fullName": "นาย อัสรี เจ๊ะแตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6623000315",
    "fullName": "นาย อัฟนาน มะเระ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6623000342",
    "fullName": "นางสาว อาแอเสาะ สมาแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6623000379",
    "fullName": "นางสาว มิสบะห์ มะและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6623000418",
    "fullName": "นางสาว นาสากะ สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6623000427",
    "fullName": "นาย การาฟี เนตวัน",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6623000463",
    "fullName": "นาย ฟูรกอน มะรอนิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6623000472",
    "fullName": "นาย มูฮัมหมัด อาแวกือจิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6623000520",
    "fullName": "นางสาว นัสริน อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6623000539",
    "fullName": "นาย อัสมี คอแบะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6713000030",
    "fullName": "นาย อาหมัดซูฟีลัน สาเม๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6713000058",
    "fullName": "นางสาว วรรณกูรีการ์ ดอแตดินิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6713000067",
    "fullName": "นาย มูฮัมหมัดลุตฟี มะดีเยาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6713000085",
    "fullName": "นาย อับดุลการีม เจะอาลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6713000094",
    "fullName": "นาย อับดุลเลาะ ยาวอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6713000133",
    "fullName": "นาย ผุดดาย สูลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6713000142",
    "fullName": "นางสาว รุสนีตา มะแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6713000151",
    "fullName": "นาย ซอฟรอน แวมูซอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6713000188",
    "fullName": "นางสาว ต่วนอาลียา รายอหะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6713000197",
    "fullName": "นาย นิอัสรี ดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6713000218",
    "fullName": "นาย อับดุลบาซิ สาเม๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6713000227",
    "fullName": "นาย ฟารวิน ติยี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6713000263",
    "fullName": "นาย อับดุลเลาะห์ ยายิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6713000311",
    "fullName": "นาย มูฮำหมัดฆอซาฟี ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6713000339",
    "fullName": "นาย ฮาฟิซ นิยมเดชา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6713000357",
    "fullName": "นาย มูฮัมหมัดนาอีม นิยมเดชา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6713000375",
    "fullName": "นาย อานิส ลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6713000432",
    "fullName": "นาย บัดรู วาเงาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6713000478",
    "fullName": "นาย อาลียีส สาเลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6713000487",
    "fullName": "นาย อับดุลฮากีม เจ๊ะแฮ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6713000496",
    "fullName": "นาย มุอาซ อับดุลศอมัด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6713000517",
    "fullName": "นาย ปาตะห์ แนฮะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6713000526",
    "fullName": "นาย เสรี มะเด็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6713000553",
    "fullName": "นางสาว สีตีคอลีเยาะ ยะโกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6713000562",
    "fullName": "นาย ไครุสดีน บาโอะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6713000571",
    "fullName": "นาย มูฮัมหมัดอัลอามีน มะทา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6713000580",
    "fullName": "นาย อัฟฎอล บือราเฮง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6713000610",
    "fullName": "นางสาว อามียะห์ แวนาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6713000629",
    "fullName": "นาย มูฮัมหมัดอาซีกีน ติยี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6713000638",
    "fullName": "นางสาว รอบียะห์ มามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6713000647",
    "fullName": "นาย มูฮัมมัดไพรู อูเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6713000674",
    "fullName": "นาย ฮาแว อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6713000683",
    "fullName": "นางสาว มารียะฮ์ โสะเบ็ญอาหลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6713000704",
    "fullName": "นาย อับดุลเล๊าะ ซายเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6713000713",
    "fullName": "นาบ บูเแฮรี ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6713000722",
    "fullName": "นาย อิลยาส สาแมงกานิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6713000731",
    "fullName": "นาย นิอับดุลฮาเก็ม มะสาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6713000740",
    "fullName": "นาย อับดุลซอฟฟัร มูซอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6713000759",
    "fullName": "นาย อัสลัม อัสมะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6713000786",
    "fullName": "นาย มนัส หมัดอะดรัม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6713000795",
    "fullName": "นาย อานัส บือราเฮ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000019",
    "fullName": "นาย พลวัฒน์ อาแวบือซา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6723000028",
    "fullName": "นาย อาซาน ติสมานิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6723000037",
    "fullName": "นางสาว ขนิษฐา ทิพวารี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6723000046",
    "fullName": "นาย ฮากิม เจ๊ะนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6723000055",
    "fullName": "นาย ซูภูวัน เจะปอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6723000064",
    "fullName": "นางสาว โซเฟีย ตาเยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6723000073",
    "fullName": "นางสาว สุติรา มามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6723000082",
    "fullName": "นาย อิลฮัม มะเกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6723000091",
    "fullName": "นาย ซัยดีนาอุสมาน มูดอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6723000103",
    "fullName": "นาย อานัส ดีรี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6723000112",
    "fullName": "นางสาว นูรมี มะเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6723000121",
    "fullName": "นาย นูรดีน สาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000130",
    "fullName": "นาย ต่วนนัซรู กูตูยู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6723000149",
    "fullName": "นาย อาฟฟาน หะยีบูยา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  },
  {
    "id": "6723000158",
    "fullName": "นาย อดุลย์ มีระยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000167",
    "fullName": "นาย ฮัมริ ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000176",
    "fullName": "นาย กฤษดา นามแสง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6723000185",
    "fullName": "นาย อรรถศักดิ์ ใสสว่าง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6723000194",
    "fullName": "นาย อับดุลวาริษ อัสมะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6723000206",
    "fullName": "นางสาว รอซีดะ ดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6723000215",
    "fullName": "นางสาว แวตัสณีย์ อูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6723000224",
    "fullName": "นางสาว โนรซาฟีกะห์ เจ๊ะสะนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6723000233",
    "fullName": "นาย อาดีนันต์ ปิยะปิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6723000242",
    "fullName": "นาย นาฟิซ เจ๊ะหลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6723000251",
    "fullName": "นางสาว รุสนานิง หูสูตู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6723000260",
    "fullName": "นาย มูฮัยมีน วาราวอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6723000279",
    "fullName": "นางสาว มาลีรัตน์ ต๊กซง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6723000288",
    "fullName": "นางสาว โซเฟีย ดาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6723000297",
    "fullName": "นาย มะรูดี สายู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6723000309",
    "fullName": "นางสาว ซีตีนูรฮารีซา ปอรอซู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000318",
    "fullName": "นางสาว นูรฮาฟีซาน อายิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000327",
    "fullName": "นางสาว สัลมา สังข์สวัสดิ์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000336",
    "fullName": "นางสาว ไซนะ บิดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6723000345",
    "fullName": "นาย กูอานิส ตวันดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6723000354",
    "fullName": "นาย อัฏลี นาแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000363",
    "fullName": "นาย ซากีรีน ดือมาแสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000372",
    "fullName": "นาย มูฮำหมัดนีซัม บินดาโอ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000381",
    "fullName": "นาย ฟุรกรณ์ หะเดวา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000390",
    "fullName": "นาย ซอฟียูดีน ซูดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000402",
    "fullName": "นาย มูหัมมัดกามาลุดดีน หะยีมะเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000411",
    "fullName": "นางสาว นุรฟาดีละห์ หะยีมะเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000420",
    "fullName": "นางสาว กอมารียะห์ หะยีมะเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6723000448",
    "fullName": "นางสาว สูไฮลา เปาะเล๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6723000457",
    "fullName": "นางสาว กูนาซูฮา ตูแวโวะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6723000466",
    "fullName": "นาย มูฮำหมัดอันดือราร์ เจ๊ะแวสุหลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6723000475",
    "fullName": "นาย อะฮมัดฟารุต บิน เฟาซี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6723000484",
    "fullName": "นาย ซาไฮด์ สนิแล",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6723000493",
    "fullName": "นาย มูฮัมมัดวิลดาน สะมะยีตา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6723000505",
    "fullName": "นาย รอฟีอีย์ เจะเละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6723000514",
    "fullName": "นางสาว นุรฮายาตี เด็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6723000523",
    "fullName": "นาย อาลีฟ ตาเละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6723000532",
    "fullName": "นางสาว นูรฮาฟีซา ดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6723000541",
    "fullName": "นาย มูฮัมหมัดฮากัม นิเฮง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6723000550",
    "fullName": "นาย มูฮัมหมัดฮาฟีซี มามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000569",
    "fullName": "นาย วันดาวุด หามิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000578",
    "fullName": "นาย ภูผา เจริญวิชัย",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000587",
    "fullName": "นาย อัมรูน เจ๊ะเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000596",
    "fullName": "นางสาว ซูเฟีย ปะดอวาลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000608",
    "fullName": "นาย อามีน อิสลามกุล",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6723000626",
    "fullName": "นาย มูฮำหมัดซัยฟุดดีน สะอิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6723000635",
    "fullName": "นางสาว อัซวา สะมะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6723000644",
    "fullName": "นาย แวมูฮัมหมัดซัยฟูร์ แวนามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6723000653",
    "fullName": "นาย มูฮัมหมัดปากีร มะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000662",
    "fullName": "นาย ฆอยรุดดีน ดะอุแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000671",
    "fullName": "นาย ฟูอรรถ มิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000680",
    "fullName": "นาย อาซูรี บูละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000699",
    "fullName": "นางสาว นุดา บูละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000701",
    "fullName": "นางสาว นิฟาตีเม๊าะ ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000710",
    "fullName": "นาย ฟัยรูซ ตาตูเละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000729",
    "fullName": "นาย เฟาว์วาซ มาหะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000738",
    "fullName": "นาย บีลา คอลอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6723000747",
    "fullName": "นาย โซฟียัน สะอิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6723000756",
    "fullName": "นาย ฮาฟี สาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000765",
    "fullName": "นาย ฟัครูดีน แดงเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000774",
    "fullName": "นางสาว นอรี แวนาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000783",
    "fullName": "นางสาว ปาตีเมาะ โตะบอสู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000792",
    "fullName": "นางสาว นูรฮาซีกีน อาลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6723000813",
    "fullName": "นาย มุฮำมัดนอร์ อับดุลสมัด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000015",
    "fullName": "นาย ชารีฟ แลนิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6813000024",
    "fullName": "นาย นิอาลีฟ สะแปอิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6813000033",
    "fullName": "นาย วสันต์ กาเด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6813000042",
    "fullName": "นาย อับดุลฮากิม เต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6813000051",
    "fullName": "นาย มูฮัมหมัดริสมี บือซา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000060",
    "fullName": "นาย มะสดี จาวะมาลา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000079",
    "fullName": "นาย ไพศอล เจ๊ะลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000088",
    "fullName": "นางสาว ปาลิตา ยีปง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000097",
    "fullName": "นาง สะลือมา เจ๊ะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000109",
    "fullName": "นางสาว สุดารัตน์ มะดาแฮ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000118",
    "fullName": "นาย ซาฟีอี ดือราแมง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000127",
    "fullName": "นางสาว อานีซะ ลาฮา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6813000136",
    "fullName": "นาย มูฮัมหมัดไฟซอล สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6813000145",
    "fullName": "นาย อิห์ซาน หะวี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6813000154",
    "fullName": "นาย อิรฮาม ยิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6813000163",
    "fullName": "นาย อัสมาดี ยิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6813000172",
    "fullName": "นาย มะซอฟา ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000181",
    "fullName": "นาย มูฮัมหมัดฮาฟาซัน อาบู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6813000190",
    "fullName": "นาย อัฟนัน มาหะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6813000202",
    "fullName": "นางสาว นูรอาซีฟา หะยีเซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6813000211",
    "fullName": "นางสาว แวนูรฟาเดีย แวตาเยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6813000239",
    "fullName": "นางสาว มาเรียม ยะโกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6813000248",
    "fullName": "นางสาว ฟาตีฮะห์ เจะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6813000257",
    "fullName": "นางสาว อัฟฟานี ฮารีม๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6813000266",
    "fullName": "นาย มูซัยรี มือเร๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6813000275",
    "fullName": "นางสาว ซารีนา สะมะแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6813000284",
    "fullName": "นาย อัฟรัน โซะกุนิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000293",
    "fullName": "นาย อามีน อูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000305",
    "fullName": "นางสาว เนตรนภา ดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000314",
    "fullName": "นาย ซอฟวรรณ มะหลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6813000323",
    "fullName": "นาย รอซาลี ยามา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6813000332",
    "fullName": "นาย นาดีน ยามาลา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6813000341",
    "fullName": "นาย ซัมซูดิง หะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6813000350",
    "fullName": "นาย มาหามะฮาฟีย์ ตาเยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000369",
    "fullName": "นางสาว นัสริน ยะซิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000378",
    "fullName": "นาย รอสรี แมเราะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000387",
    "fullName": "นาย มูฮัมหมัดนาซาอี เง๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000396",
    "fullName": "นาย มูฮัมดี มามุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000408",
    "fullName": "นาย นิฟาตอฮี อาแวสนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000417",
    "fullName": "นาย มูฮำหมัดศิดดีก โตะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6813000426",
    "fullName": "นาย มูฮำหมัดบัดรี มามุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6813000435",
    "fullName": "นาย อับดุลรอซะ เจ๊ะเงาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6813000444",
    "fullName": "นาย มูฮำหมัด แมเร๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6813000453",
    "fullName": "นาย มูฮำหมัดฟิตรี มะมิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6813000462",
    "fullName": "นาย ฟีรฮาน ยีดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6813000471",
    "fullName": "นางสาว นูรีฮัน มะวะวา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6813000480",
    "fullName": "นาย ซอลีฮีน มะมิงยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6813000499",
    "fullName": "นาย นาซเรนย์ คาเนร์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6813000501",
    "fullName": "นางสาว ฟาตีนา กอตอนีลอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000510",
    "fullName": "นางสาว ฮาซหม๊ะ มะสาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000529",
    "fullName": "นาย อิกบาล สาลาโด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6813000538",
    "fullName": "นางสาว อาริตต้า วามิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6813000547",
    "fullName": "นาย นุพัล แนแดวี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000556",
    "fullName": "นาย มะสะกี มามุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6813000565",
    "fullName": "นาย มูฮัมหมัดซาฟิต มะรง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6813000574",
    "fullName": "นาย อับดุลรอมัน อูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000583",
    "fullName": "นาย มูฮัมหมัดฮาฟีซี สนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000592",
    "fullName": "นางสาว อาซีซะห์ มีทอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000604",
    "fullName": "นางสาว ฮัมนะ ดาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000613",
    "fullName": "นางสาว โซเปีย บอสูดี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6813000622",
    "fullName": "นาย มุกตา สะอุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6813000631",
    "fullName": "นาย รอมฏอน ราเซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6813000640",
    "fullName": "นางสาว จิพรรณษา มะรง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6813000659",
    "fullName": "นาย อัสรี บินเจ๊ะเตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6813000668",
    "fullName": "นาย ดารุส แซมานิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6813000677",
    "fullName": "นาย มาหะมะไฟซอล ตะโละดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6823000012",
    "fullName": "นาย กอรี เจ๊ะหม๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6823000021",
    "fullName": "นาย อับดุลฮากิม ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6823000030",
    "fullName": "นาย อับดุลฮาฟิซ มะมิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6823000049",
    "fullName": "นางสาว อาสือเราะห์ แสงดาว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6823000058",
    "fullName": "นางสาว ไอริณ มะอีลา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6823000067",
    "fullName": "นางสาว สูไพณี วานิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6823000076",
    "fullName": "นาย มูฮัมหมัดฟิรดาว สูลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6823000085",
    "fullName": "นางสาว สุรยานี มะดีเยาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000094",
    "fullName": "นางสาว คอติมา ดือราแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000106",
    "fullName": "นางสาว แวซาฟีนี ดามูหิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6823000115",
    "fullName": "นาย ต่วนมูฮัมหมัดอิมรอล ต่วนปูเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6823000124",
    "fullName": "นาย ปฏิภาน พุฒขวัญ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6823000133",
    "fullName": "นาย มะอารีฟีน ดอแตบายะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6823000142",
    "fullName": "นาย อาลียะห์ อุเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6823000151",
    "fullName": "นาย อิสมาแอล สังข์สวัสดิ์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6823000160",
    "fullName": "นาย ลุตฟาน หะยีดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6823000179",
    "fullName": "นาย ไฟซอล แซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6823000188",
    "fullName": "นาย อาลิฟ ปาเนาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6823000197",
    "fullName": "นาย บัรกิ เบนสูหลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6823000209",
    "fullName": "นาย มูฮัมหมัดอีรอฟัต แวกาปง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6823000218",
    "fullName": "นาย ฮัยซูม สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6823000227",
    "fullName": "นาย อับดุลซาลาม ตะโละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6823000236",
    "fullName": "นาย อานัส แซมิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000245",
    "fullName": "นาย วัชรพล กุญจนาทไพศาล",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000254",
    "fullName": "นาย อินฟาน ยะโกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000263",
    "fullName": "นาย วันอารอฟัตร์ ยะโก๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000272",
    "fullName": "นางสาว พาอีซะห์ มะโซะเปาะยา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6823000281",
    "fullName": "นาย อารีฟาน ฮาวอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000290",
    "fullName": "นาย ซุลอิฟฮาน ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6823000311",
    "fullName": "นาย มูฮัมหมัดซอฟา ดาละ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6823000320",
    "fullName": "นาย ซุบฮี โกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6823000339",
    "fullName": "นาย มูฮำหมัดอิรฟาน ยูโซ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6823000357",
    "fullName": "นาย อับดุลฮากีม ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6823000366",
    "fullName": "นาย ฟัรฮาน อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6823000384",
    "fullName": "นางสาว นุรซาฟีกา แลนิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6823000393",
    "fullName": "นาย อุสมัน อาแวกือจิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6823000405",
    "fullName": "นางสาว ซูไฮลา ซูมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6823000414",
    "fullName": "นาย รูสาลำ หะยีตาเฮ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6823000423",
    "fullName": "นางสาว นูรีตา มั่นแน่",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6823000432",
    "fullName": "นางสาว ดีละ มะวะวา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6823000441",
    "fullName": "นาย ฟิตรี มะสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6823000450",
    "fullName": "นางสาว นูรซัยดา วาโด",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6823000469",
    "fullName": "นาย มูซอฟฟัรต์ กามาสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6823000478",
    "fullName": "นาย อิลยาส สะอะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6823000487",
    "fullName": "นางสาว สูฮัยลา วาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6823000496",
    "fullName": "นาย ซาฟิดานียา สะนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6823000508",
    "fullName": "นาย ฟิตรี สะแลแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6823000517",
    "fullName": "นางสาว ยูรีซา ดามะเล๊าะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6823000526",
    "fullName": "นางสาว อัสนะห์ แซอิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000535",
    "fullName": "นางสาว คอยรุนนีซาอ์ มอลอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000544",
    "fullName": "นางสาว รุสลีนา ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000553",
    "fullName": "นาย ฟิรเดาว์ อารงค์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000562",
    "fullName": "นาย มูฮัมหมัดกามาล ยาโก๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6823000580",
    "fullName": "นาย อาฟานดี อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000599",
    "fullName": "นางสาว ฮาซูรา กูโน",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6823000610",
    "fullName": "นาย อาดัม ยีลาบอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6823000638",
    "fullName": "นาย อัฟฏ๊อล สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6823000647",
    "fullName": "นางสาว พาซียะห์ เจ๊ะมุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6823000656",
    "fullName": "นางสาว บิสมี มะดายา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6823000665",
    "fullName": "นาย กอยา สะนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6823000674",
    "fullName": "นาย มะซานูซี หะซา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6913000018",
    "fullName": "นาย นิอาราฟัต นิเงาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230032"
  },
  {
    "id": "6913000027",
    "fullName": "นาย อิมรอน อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6913000036",
    "fullName": "นาย อับดุลรอมัน ยะอิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6913000045",
    "fullName": "นาย รอฮามัน หามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913000054",
    "fullName": "นาย อับดุลก๊อฟฟาร์ ฮามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913000063",
    "fullName": "นาย ฮาฟิซ หะมะรอแมโน",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913000072",
    "fullName": "นาย อิสมาแอล จูกูยี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913000081",
    "fullName": "นาย ชารีฟ สาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000090",
    "fullName": "นางสาว นัสริน อาแวกือจิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000102",
    "fullName": "นาย มูฮัมมัดอาฟัยซอล บาหลัง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000111",
    "fullName": "นาย มูฮัมมัดอัฎฮา กือจิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000120",
    "fullName": "นาย อัสรี เบ็ญยูนุ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000139",
    "fullName": "นาย เคนรินทร์ กะลิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000148",
    "fullName": "นางสาว รอฮานิง สาแม็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000157",
    "fullName": "นาย นพพล ดาโอ๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000166",
    "fullName": "นาย อัสลิม ดอรอเสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000175",
    "fullName": "นาย ฮัดดรอมี ดอรอเสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000184",
    "fullName": "นาย มูฮัมหมัดซาฟีอีน ย๊ะอิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000193",
    "fullName": "นาย ฮาฟิส เจ๊ะเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000205",
    "fullName": "นางสาว ผกาวดี ธรรมนิยม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000214",
    "fullName": "นาย เพ็ชรเกษม นาสา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000223",
    "fullName": "นาย มูหัมมัดอัฟกันร์ ดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6913000232",
    "fullName": "นาย อัสมี ดือเร๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6913000241",
    "fullName": "นาย มะไพซู หะเดวา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6913000250",
    "fullName": "นาย ชารีฟ ตาเย๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6913000269",
    "fullName": "นาย อับดุลเลาะ ม่วงพัน",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913000278",
    "fullName": "นางสาว นิซูไฮดา เจ๊ะอามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6913000287",
    "fullName": "นาย อาบูบักการ์ ดือเระ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6913000296",
    "fullName": "นางสาว นาเดีย นาแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6913000308",
    "fullName": "นางสาว นุรไอนี ยะโกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6913000317",
    "fullName": "นาย รุสวรรณ สะมาแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6913000326",
    "fullName": "นางสาว อัสมีดา ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6913000335",
    "fullName": "นาย อับดุลเลาะ ยามาแล",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6913000344",
    "fullName": "นางสาว นูรอัฟฟาณี วี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000353",
    "fullName": "นางสาว อาฟานี เจะลอแน",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000362",
    "fullName": "นาย มูฮำหมัดอลีฟี มะดิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000371",
    "fullName": "นาย ซูลฮากีมี ดะบู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000380",
    "fullName": "นาย มูหัมหมัดอาดูฮา เจ๊ะอูเซ็ง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000399",
    "fullName": "นาย ฮากีน ซาลีมะแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000401",
    "fullName": "นางสาว ฟารีดะห์ เจ๊ะแน",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000410",
    "fullName": "นาย อานิสซัน สาเรง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000429",
    "fullName": "นางสาว นูรฮาซีกีน สาแมและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6913000438",
    "fullName": "นาย มูฮัมมัดฟัยริส ลาเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6913000447",
    "fullName": "นางสาว ชนิกานต์ เจ๊ะแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6913000456",
    "fullName": "นางสาว นาซูฮา เจ๊ะดอเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6913000465",
    "fullName": "นาย อัซมี เจ๊ะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230031"
  },
  {
    "id": "6913000474",
    "fullName": "นาย มะลิกี สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6913000483",
    "fullName": "นาย วัลอัสรี สะมาแอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6913000492",
    "fullName": "นาย อัฟฟาน ยะโกะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000504",
    "fullName": "นาย อับดุลตอฟิก เปาะซูปายา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000513",
    "fullName": "นาย ปฐพี อินพะเนา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000522",
    "fullName": "นางสาว กรรณิการ์ เจ๊ะหน๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000531",
    "fullName": "นาย ฮากีมิง ดือเระ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6913000540",
    "fullName": "นาย อนุชา หะยีเปาะจิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230008"
  },
  {
    "id": "6913000559",
    "fullName": "นาย ซักวาน ตาเยะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000568",
    "fullName": "เด็กชาย มูฮัดดิส มะแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6913000577",
    "fullName": "เด็กชาย ฟุรกอน มะแซ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6913000586",
    "fullName": "นางสาว อริษา สะเลง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913000595",
    "fullName": "นางสาว โซเฟียห์ มะลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000607",
    "fullName": "นาย อาซูวัน ดาโอะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000616",
    "fullName": "นาย ฮาซัน ตำมา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6913000625",
    "fullName": "นาย สาอุดี มะบายะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6913000634",
    "fullName": "นาย ฟิรกอน สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6913000643",
    "fullName": "นาย อักมัล แวหะมะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000652",
    "fullName": "นางสาว นิซารีฟา ปูโรง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6913000661",
    "fullName": "นาย ชามินทร์ บือซา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000670",
    "fullName": "นาย ซุลกีฟลี ดือรา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000689",
    "fullName": "นาย นิอากิซ สามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000698",
    "fullName": "นางสาว สุวรรณี ศิริ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000700",
    "fullName": "นาย อัสมิง บาอู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6913000719",
    "fullName": "นาย อิควาน แยนา",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6913000728",
    "fullName": "นาย มูนีร ปิยะปิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6913000737",
    "fullName": "นาย มูฮำหมัดอีซูวัน สะนิ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6913000746",
    "fullName": "นาย ฟุรกอน ตาเห",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230007"
  },
  {
    "id": "6913000755",
    "fullName": "นางสาว นาตาชา เจ๊ะเลาะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6913000764",
    "fullName": "นางสาว อารินดา ปานาหม๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230005"
  },
  {
    "id": "6913000773",
    "fullName": "นางสาว เครือแก้ว แสงทิพย์",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6913000782",
    "fullName": "นางสาว กนกพิญ์ แดงดี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230016"
  },
  {
    "id": "6913000791",
    "fullName": "นาย มูซัมมีล วาแตลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230003"
  },
  {
    "id": "6913000803",
    "fullName": "นาย อัฟฟาน มะอู",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230022"
  },
  {
    "id": "6913000812",
    "fullName": "นางสาว วาตี เจ๊ะอามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230033"
  },
  {
    "id": "6913000821",
    "fullName": "นาย นาราชา มาหะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6913000830",
    "fullName": "นางสาว กัสมีนี สาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230010"
  },
  {
    "id": "6913000849",
    "fullName": "นางสาว อานันดา สาแม",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000858",
    "fullName": "นาย มะยาลี มามะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000867",
    "fullName": "นางสาว บุสตานีย์ แมเราะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000876",
    "fullName": "นาย ฮารีฟี มะรง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6913000885",
    "fullName": "นางสาว อัซมาณี โวะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230012"
  },
  {
    "id": "6913000894",
    "fullName": "นาย อาดัน ลาเตะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6913000906",
    "fullName": "นางสาว สีตีพาตีเมาะห์ อาแว",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230011"
  },
  {
    "id": "6913000915",
    "fullName": "นาย วาริต มะลี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6913000924",
    "fullName": "นาย อับดุลฟากิร สาบีดี",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230034"
  },
  {
    "id": "6913000933",
    "fullName": "นาง มารีเยาะ ยูโซะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000942",
    "fullName": "นางสาว ลาตีปะห์ อารง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230002"
  },
  {
    "id": "6913000951",
    "fullName": "นาย มูฮัมหมัดฟูรกอน เจ๊ะหะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230004"
  },
  {
    "id": "6913000960",
    "fullName": "นางสาว ณัชรีญา ดอสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230038"
  },
  {
    "id": "6913000979",
    "fullName": "นาย ฟีดาอีย์ ปูเต๊ะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230014"
  },
  {
    "id": "6913000988",
    "fullName": "นาย อิกรอม แวซาและ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230037"
  },
  {
    "id": "6913000997",
    "fullName": "นาย มะลีซา อาราดินิง",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230015"
  },
  {
    "id": "6913001006",
    "fullName": "นาย รุสลัน รือสะ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230001"
  },
  {
    "id": "6913001024",
    "fullName": "นาย อาฮามะ เจ๊ะลอ",
    "levelText": "มัธยมศึกษาตอนปลาย",
    "groupCode": "230039"
  }
];

export function parseLevel(levelText: string): EducationLevel {
  if (levelText.includes('ประถม')) return 'primary';
  if (levelText.includes('ตอนต้น') || levelText.includes('ม.ต้น')) return 'junior_high';
  return 'senior_high';
}

export const INITIAL_STUDENTS_FROM_PDF: Student[] = RAW_STUDENTS.map((raw) => {
  const level = parseLevel(raw.levelText);
  const advisor = getAdvisorForGroup(raw.groupCode);
  return {
    id: raw.id,
    nationalId: `19699${raw.id.slice(-8)}`,
    fullName: raw.fullName,
    level,
    groupCode: raw.groupCode,
    groupName: `กลุ่ม ${raw.groupCode} (${advisor})`,
    advisorName: advisor,
    phone: '',
  };
});
